{
  "CH0_S1": {
    "text": [
      "500 tahun lalu, langit ibu kota kekaisaran runtuh oleh api iblis.",
      "{PLAYER_NAME}, ksatria kerajaan yang disumpah menjaga sang putri, berdiri di gerbang yang retak.",
      "Almighty Zabx memimpin badai api dari singgasana hitamnya, menertawakan manusia terakhir.",
      "Zabx: \"Kau gagal melindungi rakyatmu. Menyerahlah.\"",
      "{PLAYER_NAME}: \"Selama aku bernapas, istana ini tidak jatuh.\"",
      "Pedang pusaka memanas di tanganmu sementara jeritan rakyat berpadu dengan auman iblis."
    ],
    "choices": [
      {
        "label": "Lanjut",
        "next_scene": "CH0_S2"
      }
    ]
  },
  "CH0_S2": {
    "text": [
      "Pertempuran menelan semua sekutu. Para magi kerajaan membentuk lingkaran di aula singgasana.",
      "Mereka menyalakan sihir warisan untuk memerangkap Zabx di kastilnya sendiri.",
      "Putri: \"Kaburlah bersamaku, {PLAYER_NAME}!\"",
      "{PLAYER_NAME}: \"Jika aku pergi, tidak ada yang mengulur Zabx. Segelkan dia sekarang!\"",
      "Cahaya kuno memeluk kastil dan menarik seluruh struktur ke alam bayangan."
    ],
    "choices": [
      {
        "label": "Kalung itu menyala...",
        "next_scene": "CH0_S3"
      }
    ]
  },
  "CH0_S3": {
    "text": [
      "Zabx menancapkan cakar kegelapan ke dadamu tepat sebelum segel mengatup.",
      "Zabx: \"Sebagai hadiah atas kegagalanmu, hiduplah selamanya dalam penyesalan.\"",
      "Kutukan itu menahan tubuhmu di ambang kematian, membuatmu abadi.",
      "Kau jatuh di tangga istana, menyaksikan para magi lenyap dan sang putri terpisah oleh reruntuhan.",
      "Kemenangan terasa pahit: kau selamat, tapi tidak bisa menyelamatkan siapa pun."
    ],
    "choices": [
      {
        "label": "Hadapi Shadow Slime",
        "next_scene": "BATTLE_TUTORIAL_1"
      }
    ]
  },
  "CH0_S4_POST_BATTLE": {
    "text": [
      "Ratusan tahun berlalu. Kerajaan runtuh, nama-nama kota berubah, namun wajahmu tetap sama.",
      "Orang-orang dari berbagai era berbisik: \"Itu ksatria abadi dari kisah runtuhnya imperium.\"",
      "Segel Zabx melemah, membuat dunia modern membentuk guild pemburu untuk bertahan.",
      "Kau menahan rasa bersalah sambil menunggu tanda dari para magi.",
      "Bisikan samar akhirnya membawamu ke arah Pekanbaru, pusat penelitian segel."
    ],
    "choices": [
      {
        "label": "Pegang janji terakhirnya",
        "next_scene": "CH0_S5"
      }
    ]
  },
  "CH0_S5": {
    "text": [
      "Dengan zirah tua disembunyikan di balik jubah kelana, kau menuju kota-kota baru.",
      "Kapal dagang menurunkanmu di Selatpanjang sebelum melanjutkan perjalanan.",
      "Para pelaut bercerita tentang Siak yang memiliki guild serta penyembuh bernama Umar.",
      "Untuk memahami dunia ini dan mengawasi aktivitas iblis, kau memutuskan memulai perjalanan dari Siak.",
      ">> PROLOG selesai. Tujuan utama: masuk ke Siak dan kumpulkan informasi tentang segel Zabx."
    ],
    "choices": [
      {
        "label": "Buka world map",
        "next_scene": "GO_TO_WORLD_MAP"
      }
    ]
  },
  "CH1_SIAK_ENTRY": {
    "text": [
      "Gerbang Siak berdiri di atas sungai berkabut.",
      "Penjaga: \"Guild kota ini merekrut pemburu untuk menahan sisa pasukan Zabx.\"",
      "Tatapan mereka terhenti pada wajahmu yang tidak menua.",
      "Penjaga: \"Kau mirip ksatria dari cerita lama... tapi siapa pun kau, masuklah dan istirahat.\""
    ],
    "choices": [
      {
        "label": "Masuk kota",
        "next_scene": "SIAK_CITY_MENU"
      }
    ]
  },
  "CH1_UMAR_CLINIC": {
    "text": [
      "Klinik Safiya penuh aroma herbal. Umar menyambutmu dengan senyum gugup.",
      "Umar: \"Luka di tubuhmu seperti bekas sihir abad lampau.\"",
      "Sigil kutukan di dadamu berpendar saat Umar mendekat.",
      "Umar: \"Kakek buyutku melayani istana. Ia menulis tentang seorang ksatria abadi... wajahmu sama persis.\""
    ],
    "choices": [
      {
        "label": "Tanya tentang simbol itu",
        "next_scene": "CH1_UMAR_CORE"
      },
      {
        "label": "Tetap diam",
        "next_scene": "CH1_UMAR_CORE"
      }
    ]
  },
  "CH1_UMAR_CORE": {
    "text": [
      "Umar membuka jurnal tua bergambar sigil kekaisaran.",
      "Umar: \"Kau mencoba menyelamatkan kaisar dan putrinya, bukan?\"",
      "{PLAYER_NAME}: \"Aku gagal. Itu saja yang perlu kau tahu.\"",
      "Umar: \"Safiya, ibuku, berjanji menolongmu jika suatu saat kau kembali. Izinkan aku menebus utang keluarga kami.\"",
      ">> Umar bergabung sebagai healer dan mewarisi teknik pemurnian Safiya."
    ],
    "choices": [
      {
        "label": "Lanjut",
        "next_scene": "SIAK_CITY_MENU_AFTER_UMAR"
      }
    ]
  },
  "CH1_GATE_ALERT": {
    "text": [
      "Sirene guild meraung. Kabut ungu menutupi sungai.",
      "Penjaga: \"Gerombolan iblis air menerobos! Semua pemburu ke gerbang!\"",
      "Umar: \"{PLAYER_NAME}, dunia ingin tahu apakah legenda itu nyata. Buktikan pada mereka.\""
    ],
    "choices": [
      {
        "label": "Bantu penjaga Siak",
        "next_scene": "BATTLE_SIAK_GATE"
      }
    ]
  },
  "CH1_GATE_AFTER": {
    "text": [
      "Serangan berhasil dipukul mundur. Penduduk memanggilmu 'Ksatria Abadi'.",
      "Penjaga: \"Siak berhutang pada kalian.\"",
      "Umar: \"Kau tidak harus memikul semuanya sendiri. Biar aku ikut.\"",
      "{PLAYER_NAME}: \"Aku butuh informasi, bukan pengikut.\"",
      "Umar: \"Kalau begitu kita ke Rengat. Reza meneliti segel Zabx di sana.\""
    ],
    "choices": [
      {
        "label": "Bicara dengan Umar",
        "next_scene": "CH1_POINTER_RENGAT"
      }
    ]
  },
  "CH1_POINTER_RENGAT": {
    "text": [
      "Umar: \"Menara Rengat menyimpan arsip peninggalan kekaisaran.\"",
      "Umar: \"Reza bisa membaca rune segel yang menjaga kastil Zabx.\"",
      "Umar: \"Latih dirimu di guild sampai cukup kuat, lalu temui dia.\"",
      ">> MAIN QUEST diperbarui: Cari Reza di Rengat (Lv 5)."
    ],
    "choices": [
      {
        "label": "Buka world map",
        "next_scene": "SET_MAIN_RENGAT"
      }
    ]
  },
  "CH2_RENGAT_GATE": {
    "text": [
      "Runik biru menyelimuti gerbang Rengat.",
      "Penjaga: \"Kami mengenali wajahmu dari lukisan istana tua... kau benar-benar hidup?\"",
      "Penjaga: \"Kalau kau mencari Kampar, bicaralah dengan Reza. Tapi jangan seret rakyat kami ke kutukan lagi.\""
    ],
    "choices": [
      {
        "label": "Masuki kota magis",
        "next_scene": "CH2_REZA_TOWER"
      }
    ]
  },
  "CH2_REZA_TOWER": {
    "text": [
      "Menara batu Rengat sunyi kecuali suara halaman buku yang dibalik.",
      "Reza: \"Guild sudah memperingatkanmu untuk pulang? Bagus. Lakukan itu.\"",
      "{PLAYER_NAME}: \"Aku datang untuk memeriksa segel Zabx.\"",
      "Sigil kutukanmu bersinar, membuat Reza terdiam."
    ],
    "choices": [
      {
        "label": "Tunjukkan sigil kutukan abadi",
        "next_scene": "CH2_REZA_REVEAL"
      }
    ]
  },
  "CH2_REZA_REVEAL": {
    "text": [
      "Reza menatapmu lekat-lekat.",
      "Reza: \"Lukisan di arsip menunjukkan ksatria yang sama... kaisar memanggilmu 'perisai terakhir'.\"",
      "{PLAYER_NAME}: \"Perisai itu pecah.\"",
      "Reza: \"Jika kau masih hidup, berarti kutukan Zabx nyata. Aku ingin tahu kenapa segelnya retak lagi.\""
    ],
    "choices": [
      {
        "label": "Dengar cerita lebih jauh",
        "next_scene": "CH2_REZA_PAST"
      }
    ]
  },
  "CH2_REZA_PAST": {
    "text": [
      "Reza: \"Setelah kekaisaran jatuh, para magus menyegel Zabx di kamarnya sendiri.\"",
      "Reza: \"Segel itu bertahan lima abad, tapi energi baru di Kampar membuatnya goyah.\"",
      "Reza: \"Jika Zabx bebas, kota-kota baru seperti Siak dan Pekanbaru akan luluh dalam sehari.\"",
      "Umar: \"Apa yang bisa kita lakukan?\"",
      "Reza: \"Cari sumber retakan di Kampar... tapi sebelum itu, lindungi kota ini dari penjaga yang terkorupsi.\""
    ],
    "choices": [
      {
        "label": "Apa itu?!",
        "next_scene": "CH2_GOLEM_ALERT"
      }
    ]
  },
  "CH2_GOLEM_ALERT": {
    "text": [
      "Tanah berguncang. Golem hutan muncul dengan tubuh penuh rune rusak.",
      "Reza: \"Dia dulu pelindung Rengat. Sekarang energi Zabx merusaknya.\"",
      "Umar: \"Bebaskan dia dari pengaruh iblis!\""
    ],
    "choices": [
      {
        "label": "Lindungi Rengat",
        "next_scene": "BATTLE_RENGAT_GOLEM"
      }
    ]
  },
  "CH2_GOLEM_AFTER": {
    "text": [
      "Golem runtuh dan berubah menjadi serpihan lumut.",
      "Sigil kutukanmu meredup setelah menyerap energi liar.",
      "Reza: \"Kutukanmu menstabilkan retakan... menarik.\"",
      "Reza: \"Aku ikut. Kampar tidak boleh dibiarkan bangkit.\""
    ],
    "choices": [
      {
        "label": "Biarkan Reza bergabung",
        "next_scene": "ADD_REZA_PARTY"
      }
    ]
  },
  "CH2_REZA_JOINS": {
    "text": [
      "Reza resmi bergabung dan membawa grimoire segel kuno.",
      "Reza: \"Sebelum Kampar, kita butuh logistik dari Pekanbaru.\"",
      "Reza: \"Di sana ada akademisi yang meneliti kabar tentang Zabx.\""
    ],
    "choices": [
      {
        "label": "Rencanakan perjalanan",
        "next_scene": "CH2_PEKANBARU_POINTER"
      }
    ]
  },
  "CH2_PEKANBARU_POINTER": {
    "text": [
      "Reza: \"Kumpulkan peralatan terbaik di Pekanbaru dan cari rumor tentang elemen-elemen yang muncul di Kampar.\"",
      ">> MAIN QUEST: Pergi ke Pekanbaru (Lv 8) untuk mempersiapkan penyerbuan Kampar."
    ],
    "choices": [
      {
        "label": "Buka world map",
        "next_scene": "SET_MAIN_PEKANBARU"
      }
    ]
  },
  "CH3_PEKANBARU_ENTRY": {
    "text": [
      "Pekanbaru penuh spanduk peringatan mengenai ancaman Kampar.",
      "Pedagang berbisik bahwa pasukan Zabx kadang terlihat di utara.",
      "NPC: \"Kastil hitam itu menarik para pemburu seperti lalat. Mereka jarang kembali.\""
    ],
    "choices": [
      {
        "label": "Cari informasi di kafe gelap",
        "next_scene": "CH3_PEKANBARU_CAFE"
      }
    ]
  },
  "CH3_PEKANBARU_CAFE": {
    "text": [
      "Di kafe remang, seorang tetua menatap wajahmu lama sekali.",
      "Tetua: \"Aku pernah melihat lukisanmu di arsip kerajaan. Kau ksatria yang gagal menyelamatkan putri, bukan?\"",
      "{PLAYER_NAME}: \"Aku tidak butuh pengingat.\"",
      "Tetua: \"Zabx juga gagal. Itu sebabnya ia meronta di segelnya. Kampar memanggil kalian berdua.\"",
      "Tetua: \"Jika pergi ke Kampar, bawalah pedangmu sendiri. Kastil itu mengenali pemiliknya.\""
    ],
    "choices": [
      {
        "label": "Biarkan cerita mengalir",
        "next_scene": "CH3_DREAM"
      }
    ]
  },
  "CH3_DREAM": {
    "text": [
      "Malam itu, mimpi menenggelamkanmu kembali ke hari terakhir kekaisaran.",
      "Kau melihat sang putri memohon agar kau pergi, sementara Zabx menertawakan kelemahan manusia.",
      "Zabx: \"Aku akan menghapus namamu dari sejarah.\"",
      "Putri: \"Tidak... {PLAYER_NAME}, hiduplah meski tanpa kami.\"",
      "Segel tertutup, meninggalkanmu seorang diri."
    ],
    "choices": [
      {
        "label": "Bangun dari mimpi",
        "next_scene": "CH3_WAKE"
      }
    ]
  },
  "CH3_WAKE": {
    "text": [
      "Kau terbangun dengan dada berdenyut.",
      "{PLAYER_NAME}: \"Aku mendengar suara putri lagi. Segel Zabx memanggilku.\"",
      "Reza: \"Kalau begitu kita tidak punya waktu. Kampar harus ditangani sebelum elemen gelapnya meluber.\""
    ],
    "choices": [
      {
        "label": "Terima panggilan Kampar",
        "next_scene": "CH3_KAMPAR_POINTER"
      }
    ]
  },
  "CH3_KAMPAR_POINTER": {
    "text": [
      ">> MAIN QUEST: Menuju Kampar – pusat segel Zabx (Lv 12).",
      "Umar: \"Apapun luka masa lalu, kali ini kita hadapi bersama.\""
    ],
    "choices": [
      {
        "label": "Buka world map",
        "next_scene": "SET_MAIN_KAMPAR"
      }
    ]
  },
  "SQ_HARSAN_BLADE_INTRO": {
    "text": [
      "Di perpustakaan Pekanbaru, arsiparis tua menatap wajahmu dengan mata melebar.",
      "Arsiparis: \"Ada relief kuno bergambar ksatria abadi... kau mirip sosok itu.\"",
      "Arsiparis: \"Relief itu menyebut pedang imperial yang hilang saat kekaisaran jatuh.\"",
      "Arsiparis: \"Katanya pedang itu disembunyikan di kuil terpencil agar Zabx tidak bisa menggunakannya.\"",
      "{PLAYER_NAME}: \"Di mana kuil itu?\"",
      "Arsiparis: \"Antara Rengat dan Kampar ada Kuil Cahaya Terlupakan. Hanya pemilik sigil yang bisa membukanya.\""
    ],
    "choices": [
      {
        "label": "Menuju kuil cahaya terlupakan",
        "next_scene": "SQ_HARSAN_SHRINE_TRAVEL"
      },
      {
        "label": "Kembali ke Pekanbaru",
        "next_scene": "BACK_CITY_MENU"
      }
    ]
  },
  "SQ_HARSAN_SHRINE_TRAVEL": {
    "text": [
      "Perjalanan menyusuri sungai berkabut membawamu ke celah batu bermotif lambang kerajaan.",
      "Reza: \"Rune-nya mirip catatan tentang pedang imperialmu.\"",
      "Umar: \"Kutukanmu berdenyut kencang. Pedang itu masih mengenalmu.\"",
      "{PLAYER_NAME}: \"Kalau Zabx menemukannya lebih dulu, dunia tamat. Kita masuk.\""
    ],
    "choices": [
      {
        "label": "Masuki Kuil Cahaya Terlupakan",
        "next_scene": "SQ_HARSAN_BLADE_SHRINE"
      },
      {
        "label": "Kembali ke Pekanbaru",
        "next_scene": "BACK_CITY_MENU"
      }
    ]
  },
  "SQ_HARSAN_BLADE_SHRINE": {
    "text": [
      "Kuil sunyi dipenuhi patung ksatria yang patah.",
      "Di tengah ruangan ada empat tumpuan batu yang menunggu sigilmu.",
      "Udara terasa berat seolah pedang itu menahan napas selama lima abad."
    ],
    "choices": [
      {
        "label": "Tempelkan sigil ke tumpuan",
        "next_scene": "SQ_HARSAN_SHRINE_PILLARS"
      },
      {
        "label": "Keluar dari kuil",
        "next_scene": "BACK_CITY_MENU"
      }
    ]
  },
  "SQ_HARSAN_SHRINE_PILLARS": {
    "text": [
      "Begitu kau menyentuhkan sigil pada tumpuan, jalur cahaya terbuka.",
      "Rune-rune menyusun ulang simbol keluarga kerajaan.",
      "Bayangan kutukan mencoba merembes keluar dari celah altar."
    ],
    "choices": [
      {
        "label": "Hadapi bayangan penjaga",
        "next_scene": "BATTLE_ABYSS_SHADE"
      },
      {
        "label": "Tarik napas dan mundur",
        "next_scene": "SQ_HARSAN_BLADE_SHRINE"
      }
    ]
  },
  "SQ_HARSAN_SHRINE_CORE": {
    "text": [
      "Di ruang terdalam terdapat pedang kusam dengan sarung retak.",
      "Umar: \"Aura pedang itu seperti menahan diri untuk tidak menyakitimu.\"",
      "Reza: \"Energi Zabx masih menempel. Bersihkan dengan sigilmu.\""
    ],
    "choices": [
      {
        "label": "Bangunkan penjaga cahaya",
        "next_scene": "BATTLE_HARSAN_SENTINEL"
      },
      {
        "label": "Sentuhkan kalung ke pedang",
        "next_scene": "SQ_HARSAN_BLADE_VISION"
      },
      {
        "label": "Kembali ke Pekanbaru",
        "next_scene": "BACK_CITY_MENU"
      }
    ]
  },
  "SQ_HARSAN_BLADE_VISION": {
    "text": [
      "Saat sigil menyentuh pedang, kau melihat kilasan para magi menyembunyikan senjata itu.",
      "Mereka berpesan: \"Pedang ini hanya boleh bangkit jika ksatria abadi siap menanggungnya lagi.\"",
      "Cahaya menghapus karat, mengembalikan bentuk asli pedang imperial.",
      "Sistem: \" >> Kamu memperoleh Pedang Warisan Kekaisaran – bilah asli milik {PLAYER_NAME}.\""
    ],
    "choices": [
      {
        "label": "Kembali ke Pekanbaru",
        "next_scene": "BACK_CITY_MENU"
      }
    ]
  },
  "CH4_KAMPAR_ENTRY": {
    "text": [
      "Begitu melewati batas Kampar, warna dunia pudar.",
      "Rumah-rumah hancur dan udara dipenuhi abu.",
      "Umar: \"Tidak ada nyawa manusia di sini... hanya kutukan.\"",
      "Reza: \"Segel utama berada di kastil Zabx di tengah kota.\""
    ],
    "choices": [
      {
        "label": "Biarkan kalung memandu",
        "next_scene": "CH4_FLASHBACK"
      }
    ]
  },
  "CH4_FLASHBACK": {
    "text": [
      "Sigil di dadamu menyala, memperlihatkan kilas balik lima abad silam.",
      "Kau melihat dirimu tersungkur di tangga istana.",
      "Para magi memisahkan pedang pusaka dari sigilmu agar Zabx tidak menguasainya.",
      "Mereka berbisik: \"Jika pedang dan sigil bersatu lagi, pastikan itu terjadi karena pilihan sang ksatria.\""
    ],
    "choices": [
      {
        "label": "Teruskan penglihatan",
        "next_scene": "CH4_FLASHBACK_2"
      }
    ]
  },
  "CH4_FLASHBACK_2": {
    "text": [
      "Kilas balik berlanjut. Zabx menciptakan kastil hitam di Kampar untuk melawan segel.",
      "Para magi memancingnya masuk sebelum mengunci pintu antara dunia.",
      "Kau memohon agar pedangmu disembunyikan sampai kau siap menebus kegagalan.",
      "Kilatan cahaya menarikmu kembali ke masa kini, tepat di depan gerbang kastil Zabx."
    ],
    "choices": [
      {
        "label": "Menuju kastil Zabx",
        "next_scene": "CH4_CASTLE_APPROACH"
      }
    ]
  },
  "CH4_CASTLE_APPROACH": {
    "text": [
      "Kastil Zabx menjulang, seolah menghirup cahaya dari seluruh Kampar.",
      "Umar: \"Di sinilah sejarahmu berhenti... dan dimulai lagi.\"",
      "Reza: \"Jangan biarkan penyesalan menguasai langkahmu.\""
    ],
    "choices": [
      {
        "label": "Masuk ke Kastil Zabx",
        "next_scene": "CH5_CASTLE_ENTRY"
      }
    ]
  },
  "CH5_CASTLE_ENTRY": {
    "text": [
      "Lantai 1 – Koridor bayangan berisi patung ksatria yang meleleh.",
      "Aura Zabx membuat langkah terasa berat.",
      "Umar: \"Kutukan ini ingin membuat kita lupa tujuan.\"",
      "Reza: \"Jangan berhenti. Gerbang berikutnya akan menguji tekadmu.\""
    ],
    "choices": [
      {
        "label": "Terus ke Balai Kekosongan",
        "next_scene": "CH5_FLOOR2"
      }
    ]
  },
  "CH5_FLOOR2": {
    "text": [
      "Lantai 2 – Balai Kehampaan dijaga Hound of Void berbalut api hitam.",
      "Umar: \"Elemen apinya akan melahap siapa pun yang lambat.\"",
      "Reza: \"Gunakan elemen yang tepat. Air atau cahaya bisa mematahkan pertahanannya.\""
    ],
    "choices": [
      {
        "label": "Hadapi Hound of Void",
        "next_scene": "BATTLE_HOUND_OF_VOID"
      }
    ]
  },
  "CH5_FLOOR2_AFTER": {
    "text": [
      "Hound runtuh, tapi sebelum mati ia menyayat dada Umar.",
      "Sigilmu bergetar, memulihkan Umar dengan kilatan kutukan yang berbalik arah.",
      "Umar: \"Kutukanmu... bisa menyembuhkan?\"",
      "{PLAYER_NAME}: \"Jika aku bisa mencegah kematian lagi, aku akan melakukannya.\""
    ],
    "choices": [
      {
        "label": "Naik ke Ruang Segel Lama",
        "next_scene": "CH5_FLOOR3"
      }
    ]
  },
  "CH5_FLOOR3": {
    "text": [
      "Ruang segel lama dipenuhi rune pecah dan sisa pakaian para magi kerajaan.",
      "Reza memungut jubah tuanya.",
      "Reza: \"Guru-guru kita mengorbankan segalanya di ruangan ini. Jangan buat sia-sia.\""
    ],
    "choices": [
      {
        "label": "Buka Gerbang Takdir",
        "next_scene": "CH5_FLOOR4"
      }
    ]
  },
  "CH5_FLOOR4": {
    "text": [
      "Void Sentinel melayang di depan gerbang akhir.",
      "Zabx (suara): \"Ksatria gagal... apakah kau datang untuk menontonku bebas?\"",
      "{PLAYER_NAME}: \"Aku datang untuk menutup luka yang kau buka.\""
    ],
    "choices": [
      {
        "label": "Hancurkan Void Sentinel",
        "next_scene": "BATTLE_VOID_SENTINEL"
      }
    ]
  },
  "CH5_FLOOR4_AFTER": {
    "text": [
      "Armor sentinel pecah, menyisakan jalan ke tahta.",
      "Energi gelap berputar seperti badai menunggu di atas."
    ],
    "choices": [
      {
        "label": "Masuki Tahta Kegelapan",
        "next_scene": "CH5_FLOOR5"
      }
    ]
  },
  "CH5_FLOOR5": {
    "text": [
      "Tahta Kegelapan – Almighty Zabx duduk sambil terbelenggu rune retak.",
      "Zabx: \"Wajah itu... ksatria yang gagal menyelamatkan putri kecilnya.\"",
      "{PLAYER_NAME}: \"Kutukanmu tidak akan mengikat dunia lagi.\"",
      "Zabx: \"Kutukanku membuatmu abadi, jadi kau bisa menyaksikan dunia runtuh lagi dan lagi.\"",
      "Zabx: \"Serahkan pedangmu, biar aku gunakan untuk memecah segel terakhir.\"",
      "Detak sigilmu mengingatkanmu akan Umar dan Reza; kehadiran mereka menentukan cara pertempuran berakhir."
    ],
    "choices": [
      {
        "label": "Pertarungan terakhir",
        "next_scene": "BATTLE_FEBRI"
      }
    ]
  },
  "CH5_FINAL_WIN": {
    "text": [
      "Zabx jatuh berlutut, rantai rune menahan tubuhnya.",
      "Zabx: \"Mengapa kau masih berjuang? Kau sudah kehilangan segalanya.\"",
      "{PLAYER_NAME} menatap sigil yang menyala—waktunya menentukan akhir perang ini."
    ],
    "choices": [
      {
        "label": "Gunakan cahaya untuk menentukan akhir",
        "next_scene": "RESOLVE_ENDING"
      }
    ]
  },
  "RESOLVE_ENDING": {
    "text": [
      "Sigilmu bergetar, mengingatkan pada janji Umar dan Reza.",
      "Jika Warisan Safiya dan Warisan Sang Guru telah terpenuhi, empati mereka menembus kutukan Zabx.",
      "Jika belum, satu-satunya pilihan adalah menebasnya dan menerima akhir pahit."
    ],
    "choices": [
      {
        "label": "Biarkan sigil keabadian memilih jalannya",
        "callback_data": "TRUE_ENDING_TRIGGER"
      }
    ]
  },
  "GOOD_ENDING": {
    "text": [
      "Kau menebas Zabx dengan seluruh kekuatan pedang warisan.",
      "Segel menutup kembali, tetapi energi kebencian masih bergema.",
      "Kampar stabil sementara, namun luka dunia belum sembuh.",
      "{PLAYER_NAME} kembali mengembara sebagai penjaga sunyi, Umar membuka rumah penyembuhan, Reza memimpin akademi segel.",
      "Namun kau tahu masih ada cara yang lebih damai jika luka lama disembuhkan."
    ],
    "choices": [
      {
        "label": "Kembali menjelajah",
        "next_scene": "GO_TO_WORLD_MAP"
      }
    ]
  },
  "TRUE_ENDING": {
    "text": [
      "Alih-alih menghabisi, kau menggunakan sigil kutukan untuk menyalurkan penyesalanmu sendiri.",
      "Zabx merasakan rasa bersalahmu dan berhenti mengamuk.",
      "{PLAYER_NAME}: \"Kutukanmu berakhir ketika kita berhenti saling membenci.\"",
      "Segel cahaya memulihkan Kampar, kastil hitam runtuh menjadi partikel bercahaya.",
      "Umar dan Reza menutup penyesalan masa lalu, dan dunia menyebutmu 'Ksatria Abadi yang memutus rantai kebencian'."
    ],
    "choices": [
      {
        "label": "Nikmati kedamaian",
        "next_scene": "GO_TO_WORLD_MAP"
      }
    ]
  },
  "BAD_ENDING": {
    "text": [
      "Zabx meledakkan segel dengan tawa kejam. Kampar menjadi pusat kegelapan baru.",
      "Gelombang iblis menyapu Siak, Rengat, dan Pekanbaru; Umar dan Reza gugur satu per satu.",
      "Kutukan abadi memaksa {PLAYER_NAME} menyaksikan dunia runtuh lagi tanpa bisa menghentikannya."
    ],
    "choices": [
      {
        "label": "Bangkit dari kegagalan",
        "next_scene": "GO_TO_WORLD_MAP"
      }
    ]
  },
  "SQ_UMAR_INTRO": {
    "text": [
      "Setelah Umar bergabung, desas-desus muncul di Siak.",
      "NPC: \"Keluarga di ujung kota masih menyalahkan Safiya, ibumu, atas kematian anak mereka.\"",
      "Umar menggenggam tas obat warisan keluarganya."
    ],
    "choices": [
      {
        "label": "Temui keluarga tersebut",
        "next_scene": "SQ_UMAR_FAMILY"
      }
    ]
  },
  "SQ_UMAR_FAMILY": {
    "text": [
      "Rumah panggung di ujung kota penuh tatapan marah.",
      "Orang Tua: \"Safiya menjanjikan keselamatan tapi anak kami tetap mati.\"",
      "Umar: \"Ibu menahan luka sampai akhir. Aku datang bukan untuk membela diri, tapi untuk menebus utang.\""
    ],
    "choices": [
      {
        "label": "Apa yang sebenarnya terjadi?",
        "next_scene": "SQ_UMAR_CHILD"
      }
    ]
  },
  "SQ_UMAR_CHILD": {
    "text": [
      "Dari balik pintu terdengar batuk lemah anak kecil lain.",
      "Orang Tua: \"Anak kami yang tersisa terjangkit demam yang sama.\"",
      "Umar: \"Berikan aku kesempatan. Jika gagal, benci aku, bukan ibuku.\"",
      "Untuk ramuan, Umar butuh herb langka di rawa Siak yang dijaga monster."
    ],
    "choices": [
      {
        "label": "Cari ramuan dan hadapi apa pun di rawa",
        "next_scene": "SQ_UMAR_MINIDUNGEON"
      }
    ]
  },
  "SQ_UMAR_MINIDUNGEON": {
    "text": [
      "Rawa berkabut memantulkan cahaya hijau dari herb suci.",
      "Monster berlapis lumpur melindungi tanaman itu.",
      "Umar: \"Safiya, bimbing aku melewati ketakutan ini.\""
    ],
    "choices": [
      {
        "label": "Hadapi penjaga herb",
        "next_scene": "BATTLE_UMAR_HERB"
      }
    ]
  },
  "SQ_UMAR_HEAL": {
    "text": [
      "Ramuan hangat menyelubungi tubuh anak yang demam.",
      "Napasnya kembali teratur.",
      "Orang Tua: \"Safiya... maafkan kami sudah membencimu.\"",
      "Umar: \"Yang kalian butuhkan hanyalah harapan baru. Itulah warisan keluargaku.\""
    ],
    "choices": [
      {
        "label": "Wariskan berkah Safiya",
        "next_scene": "COMPLETE_UMAR_QUEST"
      }
    ]
  },
  "SQ_UMAR_REWARD": {
    "text": [
      "Umar memandang langit Siak.",
      "Umar: \"Aku akan melindungi siapa pun yang percaya pada penyembuhan, sama seperti ibu.\"",
      "(Umar mempelajari ultimate: Anugerah Safiya.)"
    ],
    "choices": [
      {
        "label": "Kembali ke kota",
        "next_scene": "BACK_CITY_MENU"
      }
    ]
  },
  "SQ_REZA_INTRO": {
    "text": [
      "Di Rengat, seorang tetua menghampiri Reza.",
      "Tetua: \"Hutan utara memanggil namamu dengan suara yang sama seperti guru-gurumu.\"",
      "Reza menegang, mendengar gemuruh energi segel."
    ],
    "choices": [
      {
        "label": "Ikuti suara hutan",
        "next_scene": "SQ_REZA_FOREST"
      }
    ]
  },
  "SQ_REZA_FOREST": {
    "text": [
      "Hutan magis terasa kosong namun dipenuhi rune retak.",
      "Reza: \"Energi Zabx merembes sampai sini.\""
    ],
    "choices": [
      {
        "label": "Dekati segel yang retak",
        "next_scene": "SQ_REZA_SEAL"
      }
    ]
  },
  "SQ_REZA_SEAL": {
    "text": [
      "Di tengah hutan terdapat segel patah yang menyalakan gema suara.",
      "Suara Guru: \"Reza... apakah kau mengejar kebencian?\"",
      "Reza: \"Aku mengejar kebenaran agar Zabx tidak membunuh siapa pun lagi.\""
    ],
    "choices": [
      {
        "label": "Dengarkan gema guru",
        "next_scene": "SQ_REZA_MASTER"
      }
    ]
  },
  "SQ_REZA_MASTER": {
    "text": [
      "Suara Guru: \"Balas dendam hanya akan menjadikanmu cermin Zabx.\"",
      "Suara Guru: \"Lindungi ksatria abadi itu. Dia membawa harapan yang kita korbankan.\"",
      "Reza menunduk: \"Aku akan memilih perlindungan, bukan kebencian.\""
    ],
    "choices": [
      {
        "label": "Bersihkan segel yang retak",
        "next_scene": "BATTLE_REZA_SEAL"
      }
    ]
  },
  "SQ_REZA_RESOLVE": {
    "text": [
      "Segel menjadi tenang setelah pertempuran.",
      "Reza menatapmu: \"Aku akan menjaga langkahmu, bukan karena dendam, tapi karena pilihan.\""
    ],
    "choices": [
      {
        "label": "Terima warisan guru",
        "next_scene": "COMPLETE_REZA_QUEST"
      }
    ]
  },
  "SQ_REZA_REWARD": {
    "text": [
      "Gelombang sihir biru memeluk party.",
      "Reza: \"Warisan Sang Guru akan menjadi tembok baru bagi segel Zabx.\"",
      "(Reza mempelajari ultimate: Warisan Sang Guru.)"
    ],
    "choices": [
      {
        "label": "Kembali ke kota",
        "next_scene": "BACK_CITY_MENU"
      }
    ]
  }
}